/*
Для решения задачи вам нужно ввести строки с помощью функций gets или fgets, 
разбить строку на слова и выбрать нужные (функция scanf с форматом %s вводит строку до пробела, но в данной задаче вам не нужно так делать!). 
Стандартные функции работы со строками НЕ использовать! Обратите внимание, что во всех случаях слова могут разделяться любым (!) количеством символов, 
не относящихся к слову (будем считать, что к слову относятся большие и маленькие латинские буквы и цифры). 
Также обратите внимание на то, что «слово» и «подстрока» – разные термины.

Желательно всю обработку выполнить за один проход строки, хотя это возможно не во всех вариантах. 
Обязательно проверить работу программы на пустой строке и на строке, состоящей только из символов, не относящихся к слову.

Сформировать строку, удалив из каждого слова исходной строки повторяющиеся в нем буквы.

Разработать dll-библиотеку на языке С++ с функцией обработки строк (задание см. в работе «Обработка строк»).
На языке С++ написать программу, статически подключающую разработанную библиотеку, и программу, динамически подключающую разработанную библиотеку.
*/

#include "..\Dll1\StringLib.h"
#include <iostream>
#include <Windows.h>

using namespace std;

int main(int argc, char* argv[])
{
    char *Input = nullptr, *Words = nullptr, *Output = nullptr;

    SetConsoleOutputCP(CP_UTF8);

    if (argc < 2)
    {
        cout << "Недостаточно параметров!" << endl;
        return 1;
    }

    if (StringInput(Input, argv[1]))
        return 1;

    if (WordMaking(Input, Words))
        return 2;

    if (DeleteRepeatingLetter(Words, Output))
        return 3;

    if (StringOutput(Output, argv[2]))
        return 4;

	return 0;
}
